#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.
```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu plan -no-color

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # hcloud_firewall.vps_proxy will be created
  + resource "hcloud_firewall" "vps_proxy" {
      + id     = (known after apply)
      + labels = {
          + "Last-Provisioned" = "2025-09-06T16.21.02-0500"
          + "Owner"            = "willquill"
          + "Provisioner"      = "GitHub-Actions"
          + "Workflow-Actor"   = "willquill"
        }
      + name   = "vps-proxy"

      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "2222"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "51820"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "636"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "80"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = "ash-dc1"
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-13"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "Last-Provisioned" = "2025-09-06T16.21.02-0500"
          + "Owner"            = "willquill"
          + "Provisioner"      = "GitHub-Actions"
          + "Workflow-Actor"   = "willquill"
        }
      + location                   = (known after apply)
      + name                       = "vps-proxy"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cpx11"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)
      + user_data                  = "87C1H2qoypnxTU5sjPEVEgcAzAs="
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + server_id   = (known after apply)
  + server_ipv4 = (known after apply)
  + server_ipv6 = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @willquill, Action: `pull_request`, Working Directory: `opentofu`, Workflow: `OpenTofu`*